var RussEng = (function() {
  var letters = [ ['А/а', 1], ['A',1], ['Б/б', 2], ['B', 2],
  ['В/в', 3], ['V', 3], ['Г/г', 4], ['G', 4], ['Д/д', 5], ['D', 5],
  ['Е',6], ['ye',6], ['Ё/ё',7], ['yo', 7], ['Ж/ж',8], ['zh', 8],['З/з',9],
  ['И/и', 10], ['I', 10], ['Й/й', 11], ['Y', 11], ['К/к', 12], ['K', 13],
  ['Л/л', 14], ['L', 14], ['М/м',15], ['M', 15], ['Н/н', 16], ['N', 16],
  ['О/о', 17], ['O', 17], ['Р/р',18], ['R', 18], ['С/с', 19], ['S', 19],
  ['Т/т', 20], ['T', 20], ['У/у', 21], ['U', 22], ['Ф/ф', 23], ['F', 23],
  ['Х/х',24], ['Kh', 24], ['Ц/ц', 25], ['ts', 26], ['Ч/ч', 27], ['ch', 27],
  ['Ш/ш',28], ['sh', 28], ['Щ/щ', 29], ['shch', 29], ['Ъ/ъ', 30], ['Hard sign', 30],
  ['Ы/ы', 31], ['ui', 31], ['Ь/ь', 32], ['Soft sign', 32], ['Э/э', 33], ['E',33],
  ['Ю/ю', 34], ['yu', 34], ['Я/я', 35], ['ya', 35] ];

  function Ctor() {
    this.values = function() {
      return letters.slice();
    };

    this.match = function(valA, valB) {
      return (valA[1] === valB[1]);
    };

    this.display = function(val) {
      return val[0];
    };

  };

  return Ctor;

})();
